

map = {
    "a": "á",
    "à": "à",
    "a̍": "ā",
    "ǎ": "ǎ",
    "â": "â",

    "a̤": "έ",
    "à̤": "ɛ̀",
    "a̤̍": "ɛ̄",
    "ǎ̤": "ɛ̌",
    "â̤": "ɛ̂",

    "ā": "á",
    "ā̀": "à",
    "ā̍": "ā",
    "ā̌": "ǎ",
    "ā̂": "â",

    "a̯": "á",
    "à̯": "à",
    "a̯̍": "ā",
    "ǎ̯": "ǎ",
    "â̯": "â",

    "e": "é",
    "è": "è",
    "e̍": "ē",
    "ê": "ê",
    "ě": "ě",

    "ē": "é",
    "ḕ": "è",
    "ē̍": "ē",
    "ē̂": "ê",
    "ē̌": "ě",

    "i": "í",
    "ì": "ì",
    "î": "î",
    "ǐ": "ǐ",

    "o": "ó",
    "ò": "ò",
    "o̍": "ō",
    "ǒ": "ǒ",
    "ô": "ô",

    "o̠": "ɔ́",
    "ò̠": "ɔ̀",
    "o̠̍": "ɔ̄",
    "ǒ̠": "ɔ̌",
    "ô̠": "ɔ̂",
                  #in some cases
    "o̤": "ə́",     #ɑ́
    "ò̤": "ə̀",     #ɑ̀
    "o̤̍": "ə̄",     #ɑ̄
    "ô̤": "ə̂",     #ɑ̂
    "ǒ̤": "ə̌",     #ɑ̌

    "u": "ú",
    "ù": "ù",
    "u̍": "ū",
    "ǔ": "ǔ",
    "û": "û",

    "ṳ": "ʉ́",
    "ṳ̀": "ʉ̀",
    "ṳ̍": "ʉ̄",
    "ṳ̌": "ʉ̌",
    "ṳ̂": "ʉ̂",

    "u̯": "ʉ́",
    "ù̯": "ʉ̀",
    "u̯̍": "ʉ̄",
    "ǔ̯": "ʉ̌",
    "û̯": "ʉ",

    "A": "Á",
    "À": "À",
    "A̍": "Ā",
    "Ǎ": "Ǎ",
    "Â": "Â",

    "Ā": "Á",
    "Ā̀": "À",
    "Ā̍": "Ā",
    "Ā̌": "Ǎ",
    "Ā̂": "Â",


    "A̤": "Ɛ́",
    "À̤": "Ɛ̀",
    "A̤̍": "Ɛ̄",
    "Ǎ̤": "Ɛ̌",
    "Â̤": "Ɛ̂",

    "A̯": "Á",
    "À̯": "À",
    "A̯̍": "Ā",
    "Ǎ̯": "Ǎ",
    "Â̯": "Â",

    "E": "É",
    "È": "È",
    "E̍": "E̍",
    "Ě": "Ě",
    "Ê": "Ê",

    "Ē": "É",
    "Ḕ": "È",
    "Ē̍": "E",
    "Ē̌": "Ě",
    "Ē̂": "Ê",

    "O": "Ó",
    "Ò": "Ò",
    "O̍": "Ō",
    "Ǒ": "Ǒ",
    "Ô": "Ô",

    "O̱": "Ɔ́",
    "Ò̠": "Ɔ̀",
    "O̠̍": "Ɔ̄",
    "Ǒ̠": "Ɔ̌",
    "Ô̠": "Ɔ̂",

    "O̤": "Ə́",
    "Ò̤": "Ə̀",
    "O̤̍": "Ə̄",
    "Ǒ̤": "Ə̂",
    "Ô̤": "Ə̌",

    "U": "Ú",
    "Ù": "Ù",
    "U̍": "Ū",
    "Ǔ": "Ǔ",
    "Û": "Û",

    "Ṳ": "Ʉ́",
    "Ṳ̀": "Ʉ̀",
    "Ṳ̍": "Ʉ̄",
    "Ṳ̌": "Ʉ̌",
    "Ṳ̂": "Ʉ̂",

    "U̯": "Ʉ́",
    "Ù̯": "Ʉ̀",
    "U̯̍": "Ʉ̄",
    "Ǔ̯": "Ʉ̌",
    "Û̯": "Ʉ̂",

    "Ɣ": "Gh",
    "ɣ": "gh",
    "Γ": "Gh",
    "γ": "gh",
    "ṅ": "ŋ",
    "Ṅ": "Ŋ",
    "ń": "ɲ",
    "Ń": "Ɲ",
}